#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.aws_iam_role.carguero-technical-challenge-node-role: Refreshing state... [id=carguero-technical-challenge-node-role]
module.eks.data.aws_availability_zones.available: Reading...
module.eks.aws_vpc.carguero-technical-challenger-vpc: Refreshing state... [id=vpc-0867246a31a96e87f]
module.rds.aws_security_group.carguero-technical-challenge-db-sg: Refreshing state... [id=sg-0ff91074dbc347fe1]
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Reading...
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Read complete after 0s [id=3552664922]
module.eks.aws_iam_role.carguero-technical-challenge-iam-role: Refreshing state... [id=carguero-technical-challenge-role]
module.eks.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-registry-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230615184701554200000005]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cni-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230615184701541000000003]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-node-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230615184701553500000004]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cluster-policy: Refreshing state... [id=carguero-technical-challenge-role-20230615184701523400000001]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-service-policy: Refreshing state... [id=carguero-technical-challenge-role-20230615184701526800000002]
module.eks.aws_internet_gateway.carguero-technical-challenger-ig: Refreshing state... [id=igw-02f011e2fd1a6f2f7]
module.eks.aws_subnet.carguero-technical-challenger-subnet[0]: Refreshing state... [id=subnet-0e8ecfdf828e67fb2]
module.eks.aws_subnet.carguero-technical-challenger-subnet[1]: Refreshing state... [id=subnet-032d8de9f5decf0ff]
module.eks.aws_route_table.carguero-technical-challenger-rt: Refreshing state... [id=rtb-08e7a9f9044a95c9f]
module.eks.aws_eks_cluster.carguero-technical-challenge: Refreshing state... [id=carguero-technical-challenge-cluster]
module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[0]: Refreshing state... [id=rtbassoc-07e640005c92e16cc]
module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[1]: Refreshing state... [id=rtbassoc-0d407e7bb71b7dd8a]
module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[0]: Refreshing state... [id=carguero-technical-challenge-cluster:carguero-technical-challenge-node-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rds.aws_db_instance.carguero-technical-challenge-db will be created
  + resource "aws_db_instance" "carguero-technical-challenge-db" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "carguerodb"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 30
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql5.7"
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "carguero-technical-challenge-db-instance"
        }
      + tags_all                              = {
          + "Name"    = "carguero-technical-challenge-db-instance"
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + timezone                              = (known after apply)
      + username                              = "marcio"
      + vpc_security_group_ids                = [
          + "sg-0ff91074dbc347fe1",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marciojpacheco, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform plan`*